#+INCLUDE: "~/org/uni/org/config.org"
#+TITLE: Apuntes
#+TITLE: 2021-2 Probabilidad y Estadística
#+OPTIONS: toc:1
#+INCLUDE: "~/org/uni/org/config.org"
#+PROPERTY: header-args:shell :results output replace


** Ayudantía 10
:PROPERTIES:
:header-args:python: :session 1a10829f-da36-4466-ba7c-8fb7ebf93bc1 :results output
:ID:       1a10829f-da36-4466-ba7c-8fb7ebf93bc1
:END:

#+begin_src python
import scipy.stats as st
#+end_src

#+RESULTS:

#+begin_src python
mean=200
sdv=(20**0.5)
x=190
samples=10
#+end_src

#+RESULTS:
: 8.94427190999916


#+begin_src python
zScoreSample=(   (x - mean)  /   (  sdv  /  (samples**(1/2))  )   )
#+end_src

#+RESULTS:


#+name=zScoreSample
#+begin_src python
print( zScoreSample )
#+end_src

#+RESULTS:
: -7.0710678118654755


#+name=probability
#+begin_src python
# probability=st.norm.cdf(zScoreSample)
probability=st.norm.cdf(1.725)
# probability=st.norm.ppf(.975)
# probability=st.norm.ppf(.025)
print (probability)
#+end_src

#+RESULTS:
: 0.9577362637420476

#+name=percentage
#+begin_src python
percentage=probability*100
print (percentage)
#+end_src

#+RESULTS:
: 7.687298972140091e-11


